peterm2024/seniorenuhr/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-LCD-7: 8 MB Flash (N8R8!), 8 MB Octal-PSRAM
# Achtung: die Produktseite nennt 16 MB, verbaut ist aber ein 8-MB-Chip
# (per "esptool flash_id" verifiziert: GigaDevice, 8MB, Quad)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# 120 MHz statt 80: doppelte PSRAM-Bandbreite. Der RGB-Framebuffer liegt im
# PSRAM und wird per DMA dauerhaft ausgelesen - bei vollflaechigen Redraws
# (z.B. Einblend-Animation) konkurriert das Rendern mit dem Panel-DMA um
# dieselbe Bandbreite, was bei 80 MHz als Flackern sichtbar wurde.
# 120 MHz gilt bei Espressif als "experimental" (eingeschraenkter
# Temperaturbereich, <85 Grad) - fuer eine Wohnzimmer-Uhr unkritisch.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_120M=y
# Flash und PSRAM teilen sich den MSPI-Taktgeber - 120 MHz PSRAM erzwingt
# auch 120 MHz Flash (sonst Build-Fehler: Kombination 240M-Kern/80M-Flash
# existiert nicht in der Timing-Tabelle)
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
# Code/Konstanten auch aus PSRAM ausfuehrbar -> weniger Flash-Zugriffe,
# verhindert Flackern des RGB-Displays bei WLAN-/Flash-Aktivitaet
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# Groesserer Daten-Cache mit 64-Byte-Zeilen: weniger PSRAM-Transaktionen
# pro uebertragener Datenmenge (Espressif-Empfehlung fuer RGB-Panels)
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# RGB-Panel: Interrupts auch waehrend Flash-Schreibzugriffen bedienen
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
# Bei erkanntem Bildversatz (Bounce-Buffer-Unterlauf durch kurzzeitige
# PSRAM-Ueberlast) den Panel-Takt automatisch im naechsten VSYNC neu
# aufsetzen, statt dauerhaft verschoben weiterzulaufen
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y

CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# main-Task-Stack von 3584 auf 16384 erhoeht: uhr_tick() (app_main.c) baut
# beim allerersten synchronen Aufruf (noch auf dem main-Task, vor Anlegen
# des periodischen Timers) inzwischen zusaetzlich die Tabletten-/Termine-
# Uebersichtstexte selbst zusammen UND tagesansicht_tag_aktualisieren()
# ruft fuer alle 7 Wochentag-Buttons kalender_anzeige_eintraege_fuer_tag()
# auf - dieselbe Funktion mit dem grossen ics_termin_t[32]-Puffer (~3,9KB),
# die schon im Kalender-Task 16384 statt 8192 brauchte (siehe
# FALLSTRICKE_UND_WORKAROUNDS.md #8). 8192 reichte hier trotzdem nicht,
# da mehrere solcher Aufrufe + uhr_ticks eigene Puffer denselben Stack
# gleichzeitig (verschachtelt) belegen.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# HTTPS-Kalenderabruf: Zertifikatsbuendel fuer die TLS-Pruefung von
# calendar.google.com
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Selbstheilung + Ferndiagnose bei haengenden Tasks (siehe FALLSTRICKE #16):
# Bleibt eine Task (z.B. die LVGL-Task) dauerhaft haengen, loest der
# Task-Watchdog nach 5s eine Panic mit anschliessendem Neustart aus, statt
# das Geraet mit eingefrorener Anzeige stehen zu lassen - im Sinne der
# Projektregel "Anzeige von Zeit/Tabletten hat oberste Prioritaet" ist ein
# Neustart das kleinere Uebel. Der Core-Dump ueber UART liefert dabei den
# kompletten Task-Zustand fuer die Fehlersuche (espcoredump.py info_corefile,
# so wurde die Endlosschleife aus FALLSTRICKE #16 gefunden).
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_COREDUMP_ENABLE_TO_UART=y

# Bildschirmfoto per BOOT-Taste (screenshot_debug.c) - reines Entwicklungs-
# werkzeug fuer die Doku, Ausgabe als Base64-BMP ueber die serielle
# Verbindung (kein Laufzeit-/Netzwerk-Feature - ein fruehrer HTTP-Ansatz
# scheiterte an extrem langsamer Uebertragung, vermutlich PSRAM/WLAN-Bus-
# Konkurrenz beim gleichzeitigen Lesen des ~1-MB-Puffers und WLAN-Versand).
# Der Pixel-Puffer wird bewusst NICHT ueber lv_malloc() geholt (der bewusst
# kleine, feste 64-KB-Pool siehe FALLSTRICKE #16 waere dafuer viel zu klein),
# sondern manuell per heap_caps_malloc(...SPIRAM) direkt in einen selbst
# gebauten lv_draw_buf_t gereicht - CONFIG_LV_MEM_SIZE_KILOBYTES bleibt
# daher unveraendert bei 64.
CONFIG_LV_USE_SNAPSHOT=y
